name: "clip_encoder"
platform: "onnxruntime_onnx"
max_batch_size: 16
input {
  name: "pixel_values"
  data_type: TYPE_FP32
  dims: [3, 224, 224]
}
output {
  name: "image_embeds"
  data_type: TYPE_FP32
  dims: [512]
}
instance_group [{ kind: KIND_GPU }]
