name: "rtmdet_s"
platform: "onnxruntime_onnx"
max_batch_size: 0
input {
  name: "input"
  data_type: TYPE_FP32
  dims: [1, 3, 640, 640]
}
output {
  name: "boxes"
  data_type: TYPE_FP32
  dims: [1, 100, 4]
  reshape { shape: [100, 4] }
}
output {
  name: "scores"
  data_type: TYPE_FP32
  dims: [1, 100]
  reshape { shape: [100] }
}
output {
  name: "labels"
  data_type: TYPE_INT64
  dims: [1, 100]
  reshape { shape: [100] }
}
instance_group [{ kind: KIND_GPU }]
