name: "optical_flow"
platform: "onnxruntime_onnx"
max_batch_size: 0
input {
  name: "0"
  data_type: TYPE_FP32
  dims: [1, 3, 360, 480]
}
input {
  name: "1"
  data_type: TYPE_FP32
  dims: [1, 3, 360, 480]
}
output {
  name: "flow"
  data_type: TYPE_FP32
  dims: [1, 2, 360, 480]
}
instance_group [{ kind: KIND_CPU }]
