name: "depth_fastdepth"
platform: "onnxruntime_onnx"
max_batch_size: 8
input {
  name: "input"
  data_type: TYPE_FP32
  dims: [3, 224, 224]
}
output {
  name: "output"
  data_type: TYPE_FP32
  dims: [1, -1, -1]
}
instance_group [{ kind: KIND_GPU }]
